var store = [{
        "title": "リンク",
        "excerpt":"リンク (Ken Wakita, 2021-09-21) リンクの貼り方について悩んだ。いくつかの設定と Jekyll のバージョンが絡んだ問題だったようだ。   baseurl と url の設定：なにかの例を見て url に GitHub の URL を設定していたが、それを空にした。      baseurl: \"/classes\"  url: \"\"                   Jekyll V4.0 以降ではリンクの設定が簡素化され、site.baseurl の参照が不要になったとドキュメントに書かれている。ということは、それより古いバージョンの Jekyll を利用している場合はこれを明示すべきなのだろう。       ここにある[各クラスの第4クォーターの内容説明](/classes/years/y21/cs2/course.html)を読んで    なぜ、手元の Jekyll のバージョンが 3.9.0 と古いのかは不明。   ","categories": [],
        "tags": [],
        "url": "/classes/2021/09/21/link.html"
      },{
        "title": "コンピュータサイエンス第一",
        "excerpt":"LAS.I121 2021年度 3Q コンピュータサイエンス第一 担当教員 脇田　建 授業の形式 講義 / 演習 - 1単位; Zoom 使用言語 日本語 T2Schola T2Scholaへのリンク シラバス シラバスへのリンク クラス共通情報 クラス共通情報のページ講義のねらい コンピュータとともに発展してきたコンピュータサイエンスは，いまや，従来の自然科学(数学，物理，化学)などとは異なる新たらしい基礎科学となりつつある.その基本をなす考え方は，理工学の様々な 分野で重要になってくると思われる.本講義では，このコンピュータサイエンスの基本をなす考え方を， 課題をやることを通して体得するのが目的である. 参考書 渡辺治，コンピュータサイエンス，丸善サイエンスパレット，2015(1000 円+税) 講義の流れはこの本に沿っているので考え方を学ぶ参考になります。しかし、授業で採用するプログラミング言語は Python です。本は Ruby 言語を採用しているので、プログラミングの面ではあまり参考になりません。 成績評価 基本的には課題とレポートによって評価します。 配点は以下を考えています。 課題(全部で3回): 各5点 x 3回 = 15 (すべて提出したら加点 +5点) レポート1: 15点 (加点 +10点まで) + プログラム10点 =...","categories": [],
        "tags": [],
        "url": "/classes/y21/cs1.html"
      },{
        "title": "コンピュータサイエンス第二",
        "excerpt":"LAS.I122 2021年度 4Q コンピュータサイエンス第二   担当教員  脇田　建  授業の形式  講義 / 演習 - 1単位; Zoom  使用言語  日本語  T2Schola  T2Scholaへのリンク  シラバス  シラバスへのリンク  クラス共通情報  クラス共通情報のページ授業の内容       Day 1: 再帰的に定義された関数         Day 2: アルゴリズム１         Day 3: アルゴリズム２         Day 4: アルゴリズムの設計手法         Day 5: 数の表現         Day 6: 計算可能性理論         Day 7: 計算量理論   ","categories": [],
        "tags": [],
        "url": "/classes/y21/cs2.html"
      },{
        "title": "プログラミング第一",
        "excerpt":"MCS.T224 2021年度 3Q プログラミング第一 担当教員 脇田 建・叢 悠悠 授業の形式 講義 / 演習 - 3単位; 月曜 – W641，火曜・金曜 W631 使用言語 日本語 T2Schola T2Scholaへのリンク シラバス シラバスへのリンク TA（3名） 池守和槻 / 谷口力斗 / 古殿直也 いずれも増原研(M1)の猛者揃い講義の内容 Day 1: 本当の Scala プロジェクト；本当の Scala 開発 Day 2: 状態とその表現 Day 3: 例外処理 Day 4: 落穂拾い Day 5: 高階関数...","categories": [],
        "tags": [],
        "url": "/classes/y21/prg1.html"
      },{
        "title": "研究プロジェクト",
        "excerpt":"MCS.Z381-02 2021年度 34Q 研究プロジェクト 担当教員 脇田　建 授業の形式 実習 - 2単位; Zoom 使用言語 日本語 第一ラウンド 第二ラウンド 第三ラウンド Python 関連の開発環境設定 Python を用いた開発では、仮想環境を作成して、そのなかで開発することが普通です。仮想環境はプロジェクトごとに作成します。以下では、研究プロジェクトの三つのラウンドに共通する仮想環境の構築方法を説明しています。 仮想環境は labproject と命名し、~/.venvs/labproject に設定してあります。Python の仮想環境は過去に複数のものがありました。pyenv, virtualenv などが知られています。これらは Python を拡張するシステムとして開発されましたが、Python 3.7 になって Python に標準的に備わった仮想システムが提供されるようになりました。これが venv です。以下では venv を用いた仮想環境を使った環境設定について説明します。 Python 3 をインストールすること。インストールされている Python のバージョンの確認は python3 --version。 macOS の場合は brew install python3。Windows の場合は...","categories": [],
        "tags": [],
        "url": "/classes/y21/prj.html"
      },{
        "title": "情報可視化",
        "excerpt":"MCS.T412 2021年度 4Q 情報可視化 担当教員 脇田　建 授業の形式 講義 - 2単位; Zoom 使用言語 日本語 T2Schola T2Scholaへのリンク シラバス シラバスへのリンク授業の内容 LX01: What is VIS? LX02: What is VIS? / Introduction to Visual Analytics by an Example LX03: Getting started with Pandas LX04: Data Abstraction LX05: Task Abstraction - Part I LX06: Task Abstraction...","categories": [],
        "tags": [],
        "url": "/classes/y21/vis.html"
      },{
        "title": "コンピュータサイエンス第一",
        "excerpt":"LAS.I121 2022年度 3Q コンピュータサイエンス第一 担当教員 脇田　建 授業の形式 講義 / 演習 - 1.0単位; 対面 使用言語 日本語 クラス共通情報 クラス共通情報のページ講義のねらい コンピュータとともに発展してきたコンピュータサイエンスは，いまや，従来の自然科学(数学，物理，化学)などとは異なる新たらしい基礎科学となりつつある.その基本をなす考え方は，理工学の様々な 分野で重要になってくると思われる.本講義では，このコンピュータサイエンスの基本をなす考え方を， 課題をやることを通して体得するのが目的である. 参考書 渡辺治，コンピュータサイエンス，丸善サイエンスパレット，2015(1000 円+税) 講義の流れはこの本に沿っているので考え方を学ぶ参考になります。しかし、授業で採用するプログラミング言語は Python です。本は Ruby 言語を採用しているので、プログラミングの面ではあまり参考になりません。 成績評価 基本的には課題とレポートによって評価します。 配点は以下を考えています。 課題(全部で3回): 各5点 x 3回 = 15 (すべて提出したら加点 +5点) レポート1: 15点 (加点 +10点まで) + プログラム10点 = 25(+10)点 レポート2: 20点 (含:...","categories": [],
        "tags": [],
        "url": "/classes/y22/cs1.html"
      },{
        "title": "プログラミング第一",
        "excerpt":"MCS.T224 2022年度 3Q プログラミング第一   担当教員  脇田 建・叢 悠悠  授業の形式  講義 / 演習 - 3.0単位; W833  使用言語  日本語  TA（3名）  池守和槻 / 谷口力斗 / 古殿直也 いずれも増原研(M1)の猛者揃い講義の内容 ※ 演習の資料とビデオは別途配布します。T2SCHOLA か Slack を確認して下さい。 ","categories": [],
        "tags": [],
        "url": "/classes/y22/prg1.html"
      },{
        "title": "研究プロジェクト",
        "excerpt":"— 2022年度 34Q 研究プロジェクト 担当教員 脇田　建 授業の形式 実習 - 2.0単位; 対面 使用言語 日本語 第二ラウンド 第三ラウンド Python 関連の開発環境設定 Python を用いた開発では、仮想環境を作成して、そのなかで開発することが普通です。仮想環境はプロジェクトごとに作成します。以下では、研究プロジェクトの三つのラウンドに共通する仮想環境の構築方法を説明しています。 仮想環境は labproject と命名し、~/.venvs/labproject に設定してあります。Python の仮想環境は過去に複数のものがありました。pyenv, virtualenv などが知られています。これらは Python を拡張するシステムとして開発されましたが、Python 3.7 になって Python に標準的に備わった仮想システムが提供されるようになりました。これが venv です。以下では venv を用いた仮想環境を使った環境設定について説明します。 Python 3 をインストールすること。インストールされている Python のバージョンの確認は python3 --version。 macOS の場合は brew install python3。Windows の場合は python.org...","categories": [],
        "tags": [],
        "url": "/classes/y22/prj.html"
      },{
        "title": "はじめてのPython",
        "excerpt":"— 2022年度 2Q はじめてのPython   担当教員  脇田　建  授業の形式            単位;        使用言語  日本語","categories": [],
        "tags": [],
        "url": "/classes/y22/py.html"
      },{
        "title": "情報可視化",
        "excerpt":"MCS.T412 2022年度 4Q Information Visualization   担当教員  脇田　建  授業の形式  講義 - 2.0単位; 対面  使用言語  英語授業の内容 ","categories": [],
        "tags": [],
        "url": "/classes/y22/vis.html"
      },{
        "title": "コンピュータサイエンス第一",
        "excerpt":"LAS.I121 2023年度 3Q コンピュータサイエンス第一 担当教員 脇田　建 授業の形式 講義 / 演習 - 1単位; 対面 使用言語 日本語 クラス共通情報 クラス共通情報のページ講義のねらい コンピュータとともに発展してきたコンピュータサイエンスは，いまや，従来の自然科学(数学，物理，化学)などとは異なる新たらしい基礎科学となりつつある.その基本をなす考え方は，理工学の様々な 分野で重要になってくると思われる.本講義では，このコンピュータサイエンスの基本をなす考え方を， 課題をやることを通して体得するのが目的である. 参考書 渡辺治，コンピュータサイエンス，丸善サイエンスパレット，2015(1000 円+税) 講義の流れはこの本に沿っているので考え方を学ぶ参考になります。しかし、授業で採用するプログラミング言語は Python です。本は Ruby 言語を採用しているので、プログラミングの面ではあまり参考になりません。 成績評価 基本的には課題とレポートによって評価します。 配点は以下を考えています。 課題(全部で3回): 各5点 x 3回 = 15 (すべて提出したら加点 +5点) レポート1: 15点 (加点 +10点まで) + プログラム10点 = 25(+10)点 レポート2: 20点 (含:...","categories": [],
        "tags": [],
        "url": "/classes/y23/cs1.html"
      },{
        "title": "コンピュータサイエンス第二",
        "excerpt":"LAS.I122 2023年度 4Q コンピュータサイエンス第二   担当教員  脇田　建  授業の形式  講義 / 演習 - 1単位; 対面  使用言語  日本語  クラス共通情報  クラス共通情報のページ授業の内容 ","categories": [],
        "tags": [],
        "url": "/classes/y23/cs2.html"
      }]
